; domain
(define (domain domain_shakey)


    (:predicates
    
        (at ?o ?p)
        (on ?m ?b)
        (next_to ?r1 ?r2)
        (has ?r ?o)
        
        (is_robot ?r)
        (is_room ?p)
        (is_light ?b)
        (is_box ?b)
        
        (switched_on ?l)
        (robot_on_box ?r)
        (robot_has_box ?r)
        
    )


    (:action go
        :parameters (?robot ?start_room ?end_room)
        :precondition (and (is_robot ?robot) (is_room ?start_room) (is_room ?end_room) (at ?robot ?start_room) 
        (next_to ?start_room ?end_room) (not(robot_on_box ?robot)))
        :effect (and (at ?robot ?end_room) (not(at ?robot ?start_room)))
    )
    
    ; taking box
    (:action take_box
        :parameters (?robot ?box ?room)
        :precondition (and (is_robot ?robot) (is_box ?box) (is_room ?room)
        (at ?robot ?room) (at ?box ?room) (not(robot_on_box ?robot)) (not(robot_has_box ?robot)) )
        :effect (and (has ?robot ?box) (robot_has_box ?robot))
    )
    
    (:action place_box
        :parameters (?robot ?box ?room)
        :precondition (and (is_robot ?robot) (is_box ?box) (is_room ?room)
        (at ?robot ?room) (not(robot_on_box ?robot)) (robot_has_box ?robot) (has ?robot ?box) )
        :effect (and (not(has ?robot ?box)) (not(robot_has_box ?robot)) (at ?box ?room))
    )
    
    
    ; climbing on box
    (:action climb_up
        :parameters (?robot ?box ?room)
        :precondition (and (is_robot ?robot) (is_box ?box) (is_room ?room) (not(on ?robot ?box)) 
        (at ?robot ?room) (at ?box ?room))
        :effect (and (on ?robot ?box) (robot_on_box ?robot) )
    )
    
    (:action climb_down
        :parameters (?robot ?box ?room)
        :precondition (and (is_robot ?robot) (is_box ?box) (is_room ?room) (on ?robot ?box) 
        (at ?robot ?room) (at ?box ?room))
        :effect (and (not(on ?robot ?box)) (not(robot_on_box ?robot)) )
    )
    
    
    ; switching the light
    (:action switch_on
        :parameters (?robot ?room ?light ?box)
        :precondition (and (is_robot ?robot) (is_light ?light) (is_room ?room) (is_box ?box) 
        (on ?robot ?box) (at ?robot ?room) (at ?light ?room) (at ?box ?room) (not(switched_on ?light)))
        :effect (and (switched_on ?light) )
    )
    
    (:action switch_off
        :parameters (?robot ?room ?light ?box)
        :precondition (and (is_robot ?robot) (is_light ?light) (is_room ?room) (is_box ?box) 
        (on ?robot ?box) (at ?robot ?room) (at ?light ?room) (switched_on ?light))
        :effect (and (not(switched_on ?light)) )
    )
)

; problem
(define (problem problem_shakey)
    (:domain domain_shakey)

    (:objects 
            shakey 
    
            room1 room2 room3 room4 corridor
            
            box1 box2 box3 box4
            
            switch1 switch2 switch3 switch4
    )
    
    (:init 
        ; shakey
        (is_robot shakey)
        
        (at shakey room3)
        
        ; rooms
        (is_room room1)
        (is_room room2)
        (is_room room3)
        (is_room room4)
        (is_room corridor)
        
        (next_to room1 corridor) 
        (next_to corridor room1)
        
        (next_to room2 corridor) 
        (next_to corridor room2)
        
        (next_to room3 corridor) 
        (next_to corridor room3)
        
        (next_to room4 corridor) 
        (next_to corridor room4)
        
        ; boxes
        (is_box box1)
        (is_box box2)
        (is_box box3)
        (is_box box4)
        
        (at box1 room1)
        (at box2 room1)
        (at box3 room1)
        (at box4 room1)
        (at switch1 room1)
        
        (at switch2 room2)
        
        (at switch3 room3)
        
        (at switch4 room4)
        
        
        ; lights
        (is_light switch1)
        
        (is_light switch2)
        (switched_on switch2)
        
        (is_light switch3)
        (switched_on switch3)
        
        (is_light switch4)
        
        )
    
    
    (:goal (switched_on switch4))

)

; plan
1. (go shakey room3 corridor)
   deleted: (at shakey room3)
   added: (at shakey corridor)
   goals met: 0 of 1
2. (go shakey corridor room1)
   deleted: (at shakey corridor)
   added: (at shakey room1)
   goals met: 0 of 1
3. (take_box shakey box1 room1)
   added: (has shakey box1) (robot_has_box shakey)
   goals met: 0 of 1
4. (go shakey room1 corridor)
   deleted: (at shakey room1)
   added: (at shakey corridor)
   goals met: 0 of 1
5. (go shakey corridor room4)
   deleted: (at shakey corridor)
   added: (at shakey room4)
   goals met: 0 of 1
6. (place_box shakey box1 room4)
   deleted: (has shakey box1) (robot_has_box shakey)
   added: (at box1 room4)
   goals met: 0 of 1
7. (climb_up shakey box1 room4)
   added: (on shakey box1) (robot_on_box shakey)
   goals met: 0 of 1
8. (switch_on shakey room4 switch4 box1)
   added: (switched_on switch4)
   goals met: 1 of 1
